# Importing Libraries

In [1]:
import pandas as pd
import seaborn as seaborn
import matplotlib.pyplot as plt

# Importing File

In [2]:
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Droping Column

In [3]:
x = df.drop('Profit',axis=1) # asix=1 means col, axis = 0 means rows
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [4]:
y = df['Profit']
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# Manual Scaling

In [5]:
x['Marketing Spend'] = x['Marketing Spend'] / x['Marketing Spend'].max()
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617       136897.80  471784.10    Dhaka
1         0.983359       151377.59  443898.53      Ctg
2         0.927985       101145.55  407934.54  Rangpur
3         0.873136       118671.85  383199.62    Dhaka
4         0.859438        91391.77  366168.42  Rangpur

# Min Max Scaler
Scikit learn [Documentation](https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MinMaxScaler.html) of Min Max Scaler

In [6]:
from sklearn.preprocessing import MinMaxScaler
minmax = MinMaxScaler(feature_range=(0, 3)) #default range 0,1
minmax

MinMaxScaler(feature_range=(0, 3))

In [7]:
df['Marketing Spend'] = minmax.fit_transform(df[['Marketing Spend']])
df['Administration'] = minmax.fit_transform(df[['Administration']])
df['Transport'] = minmax.fit_transform(df[['Transport']])
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         2.077850        1.955232   3.000000    Dhaka  192261.83
1         2.950078        2.285915   2.822680      Ctg  191792.06
2         2.783954        1.138737   2.593991  Rangpur  191050.39
3         2.619409        1.538995   2.436705    Dhaka  182901.99
4         2.578313        0.915984   2.328407  Rangpur  166187.94

# Standard Scaler
Scikit learn [Documentation](https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html) of Standard Scaler

In [8]:
df2 = pd.read_csv('agora.csv')
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [9]:
from sklearn.preprocessing import StandardScaler
std = StandardScaler()
std

StandardScaler()

In [10]:
df2['Marketing Spend'] = std.fit_transform(df2[['Marketing Spend']])
df2['Administration'] = std.fit_transform(df2[['Administration']])
df2['Transport'] = std.fit_transform(df2[['Transport']])
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# Robust Scaler
Scikit Learn [Documentation](https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.RobustScaler.html) of Robust Scaler

In [11]:
df3 = pd.read_csv('agora.csv')
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [12]:
from sklearn.preprocessing import RobustScaler
rob = RobustScaler()
rob

RobustScaler()

In [13]:
df3['Marketing Spend'] = rob.fit_transform(df3[['Marketing Spend']])
df3['Administration'] = rob.fit_transform(df3[['Administration']])
df3['Transport'] = rob.fit_transform(df3[['Transport']])
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94

# Max Absolute Scaler
Scikit Learn [Documentation](https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MaxAbsScaler.html) of Max Absolute Scaler

In [14]:
df4 = pd.read_csv('agora.csv')
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [15]:
from sklearn.preprocessing import MaxAbsScaler
max_abs_scaler = MaxAbsScaler()
max_abs_scaler

MaxAbsScaler()

In [17]:
df4['Marketing Spend'] = max_abs_scaler.fit_transform(df4[['Marketing Spend']])
df4['Administration'] = max_abs_scaler.fit_transform(df4[['Administration']])
df4['Transport'] = max_abs_scaler.fit_transform(df4[['Transport']])
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.449332        0.198805   1.000000    Dhaka  192261.83
1         0.970189        0.401556   0.891559      Ctg  191792.06
2         0.870987       -0.301810   0.751702  Rangpur  191050.39
3         0.772728       -0.056401   0.655513    Dhaka  182901.99
4         0.748187       -0.438385   0.589283  Rangpur  166187.94